backend/app/controllers/application_controller.rb

        def current_user
            @current_user ||= authenticate_with_http_token do |token, options|
                User.find_by_token(token)
---
SELECT  "users".* FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "EQcagEmjjzRSDZb1PkCNue3U"], ["LIMIT", 1]]