backend/app/controllers/api/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 1]]
---
    def index
        @question = Question.find(params[:question_id])
        @answers = Answer.where(:question_id => @question.id)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "answers" ("question_id", "a_text", "correct", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["question_id", 1], ["a_text", "testingcrud"], ["correct", 0], ["created_at", "2018-09-23 21:06:53.604387"], ["updated_at", "2018-09-23 21:06:53.604387"]]
---
    def create
        @question = Question.find(params["question_id"])
        @answer = Answer.new(answer_params)
            if @answer.save

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show

        @answer = Answer.find(params[:id])

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
UPDATE "answers" SET "a_text" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["a_text", "testingcrudupdate"], ["updated_at", "2018-09-23 21:12:56.326533"], ["id", 25]]
---
    def update
        @answer = Answer.find(params[:id])
        if @answer.update(answer_params)

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 25]]
---
    def destroy
        @answer = Answer.find(params[:id])
        if @answer.destroy