backend/app/controllers/api/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = $1  [["quiz_id", 1]]
---
    def index
      @quiz = Quiz.find(params[:quiz_id])
      @questions = Question.where(:quiz_id => @quiz.id)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @question = Question.find(params[:quiz_id])

INSERT INTO "questions" ("quiz_id", "q_text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["quiz_id", 2], ["q_text", "Portsmithy"], ["created_at", "2018-09-23 20:03:02.733565"], ["updated_at", "2018-09-23 20:03:02.733565"]]
---
    def create
      @quiz = Quiz.find(params[:quiz_id])
      @question = @quiz.questions.create(question_params)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "questions" SET "q_text" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["q_text", "Why so many silly people go crazy?"], ["updated_at", "2018-09-23 20:14:03.459023"], ["id", 12]]
---
    def update
      @question = Question.find(params[:id])
      @quiz = Quiz.find(params[:quiz_id])
      if @quiz.published
        render json: {error: "Cannot update a published quiz"}
      elsif @question.update(question_params)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 11]]
---
    def destroy
        @question = Question.find(params[:id])
        @quiz = Quiz.find(params[:quiz_id])
        if @quiz.published
          render json: {error: "Cannot update a published quiz"}
        elsif @question.destroy